#include <cstdlib>
#include <iostream>
#include <windows.h> // Необходимо е за SetConsoleOutputCP и SetConsoleCP
using namespace std;

int main()
{
    // Настройка на конзолата на UTF-8 за коректно показване на текст
    SetConsoleOutputCP(CP_UTF8);
    SetConsoleCP(CP_UTF8);

    int a, b, c, x;
    cout << "Въведете цяло число a:";
    cin >> a;
    cout << "Въведете цяло число b: ";
    cin >> b;
    cout << "Въведете цяло число c: ";
    cin >> c;
    cout << "Въведете стойност за x: ";
    cin >> x;

    //  а) цялото число a се дели на 5;
    cout << "а) Числото a "
         << (a % 5 == 0
                 ? "се дели"
                 : "не се дели")
         << "на 5."
         << endl;
    // if (a % 5 == 0)
    // {
    //     cout << "а) Числото a се дели на 5." << endl;
    // }
    // else
    // {
    //     cout << "а) Числото a не се дели на 5." << endl;
    // }

    // б) точката x принадлежи на отсечката [2, 6];

    cout << "б) Точката x "
         << (x >= 2 && x <= 6
                 ? "принадлежи"
                 : "не принадлежи")
         << " на [2, 6]."
         << endl;

    // г) точката x принадлежи на отсечката [2, 6] или на отсечката [-4,-2];
    cout << "Точката x " << ((x >= 2 && x <= 6) || (x >= -4 && x <= -2) ? "принадлежи" : "не принадлежи")
         << " на [2, 6] или [-4, -2]." << endl;

    // д) поне едно от числата a, b и c е отрицателно;
    cout << "Поне едно от числата a, b и c "
         << (a < 0 || b < 0 || c < 0 ? "е отрицателно." : "са неотрицателни.")
         << endl;

    // е) числата a, b и c са равни помежду си.
    cout << "Числата a, b и c " 
    << (a == b && a == c ? "са равни." : "не са равни.")
     << endl;

    // a) a % 5 == 0
    // б) x >= 2 && x <= 6
    // в) x < 2 || x > 6 или !( x >= 2 && x <= 6)
    // г) x >= 2 && x <= 6 || x >= -4 && x <= -2
    // е) a == b && a == c

    system("pause");
    return EXIT_SUCCESS;
}